In [1]:
import pandas as pd

In [2]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
           "year": [2018, 2017, 2016, 2015, 2018],
           "points": [2.9, 3.7, 4.6, 5.4, 6.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [3]:
df

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN
four   2015   jungjae     5.4     NaN
five   2018   jungjae     6.9     NaN

In [4]:
df['names']

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [5]:
df.year

one      2018
two      2017
three    2016
four     2015
five     2018
Name: year, dtype: int64

In [6]:
df.names

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [7]:
df[['names','year']]

          names  year
one    sunyoung  2018
two    sunyoung  2017
three  sunyoung  2016
four    jungjae  2015
five    jungjae  2018

In [10]:
# 에러
#df['names':'points']
#df[1]

In [11]:
# 에러는 아니지만 열번호가 아닌 행번호로 인식
df[0:2]

     year     names  points penalty
one  2018  sunyoung     2.9     NaN
two  2017  sunyoung     3.7     NaN

In [15]:
#에러
#df['one']
#df[['one','three']]
#df[2]

In [16]:
df['one':'three']

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN

In [17]:
df[1:3]

       year     names  points penalty
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN

In [18]:
df

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN
four   2015   jungjae     5.4     NaN
five   2018   jungjae     6.9     NaN

In [19]:
df['penalty'] = 0.2

In [20]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.2
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.2
four   2015   jungjae     5.4      0.2
five   2018   jungjae     6.9      0.2

In [21]:
df['penalty'] = [0.1, 0.2, 0.3, 0.4,0.5]

In [22]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5

In [23]:
import numpy as np

In [24]:
df['rank'] = np.arange(5)

In [25]:
df

       year     names  points  penalty  rank
one    2018  sunyoung     2.9      0.1     0
two    2017  sunyoung     3.7      0.2     1
three  2016  sunyoung     4.6      0.3     2
four   2015   jungjae     5.4      0.4     3
five   2018   jungjae     6.9      0.5     4

In [26]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [27]:
df['debt'] = val

In [28]:
df

       year     names  points  penalty  rank  debt
one    2018  sunyoung     2.9      0.1     0   NaN
two    2017  sunyoung     3.7      0.2     1  -1.2
three  2016  sunyoung     4.6      0.3     2   NaN
four   2015   jungjae     5.4      0.4     3  -1.5
five   2018   jungjae     6.9      0.5     4  -1.7

In [29]:
df['net_points'] = df['points'] - df['penalty']

In [30]:
df

       year     names  points  penalty  rank  debt  net_points
one    2018  sunyoung     2.9      0.1     0   NaN         2.8
two    2017  sunyoung     3.7      0.2     1  -1.2         3.5
three  2016  sunyoung     4.6      0.3     2   NaN         4.3
four   2015   jungjae     5.4      0.4     3  -1.5         5.0
five   2018   jungjae     6.9      0.5     4  -1.7         6.4

In [31]:
df['high_points'] = df['net_points'] > 4.0

In [32]:
df

       year     names  points  penalty  rank  debt  net_points  high_points
one    2018  sunyoung     2.9      0.1     0   NaN         2.8        False
two    2017  sunyoung     3.7      0.2     1  -1.2         3.5        False
three  2016  sunyoung     4.6      0.3     2   NaN         4.3         True
four   2015   jungjae     5.4      0.4     3  -1.5         5.0         True
five   2018   jungjae     6.9      0.5     4  -1.7         6.4         True

In [33]:
del df['rank']

In [34]:
df

       year     names  points  penalty  debt  net_points  high_points
one    2018  sunyoung     2.9      0.1   NaN         2.8        False
two    2017  sunyoung     3.7      0.2  -1.2         3.5        False
three  2016  sunyoung     4.6      0.3   NaN         4.3         True
four   2015   jungjae     5.4      0.4  -1.5         5.0         True
five   2018   jungjae     6.9      0.5  -1.7         6.4         True

In [35]:
del df['debt']

In [36]:
del df['net_points']

In [37]:
del df['high_points']

In [38]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5

In [43]:
# 에러
#del df.names
#del df[['names','year']]
#del df['one':'three']
#del df[1]

In [44]:
df.loc[ "two":"four","names" ]

two      sunyoung
three    sunyoung
four      jungjae
Name: names, dtype: object

In [47]:
df.loc[ "two":"four", : ]

       year     names  points  penalty
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4

In [46]:
df.loc[ "two":"four"]

       year     names  points  penalty
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4

In [48]:
df.loc[ : , "year":"points"]

       year     names  points
one    2018  sunyoung     2.9
two    2017  sunyoung     3.7
three  2016  sunyoung     4.6
four   2015   jungjae     5.4
five   2018   jungjae     6.9

In [49]:
df.loc[['one','three'] , "names":"points" ]

          names  points
one    sunyoung     2.9
three  sunyoung     4.6

In [51]:
df.loc["six" , : ] = [2019, 'psy', 10, 9.9]

In [52]:
df

         year     names  points  penalty
one    2018.0  sunyoung     2.9      0.1
two    2017.0  sunyoung     3.7      0.2
three  2016.0  sunyoung     4.6      0.3
four   2015.0   jungjae     5.4      0.4
five   2018.0   jungjae     6.9      0.5
six    2019.0       psy    10.0      9.9

In [53]:
df['year'] = df['year'].astype('int32')

In [54]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5
six    2019       psy    10.0      9.9

In [55]:
df.iloc[ 1, 0:2]

year         2017
names    sunyoung
Name: two, dtype: object

In [56]:
df.iloc[ 1:3, 1:3]

          names  points
two    sunyoung     3.7
three  sunyoung     4.6

In [57]:
df.iloc[[1,3,5], [0,1]]

      year     names
two   2017  sunyoung
four  2015   jungjae
six   2019       psy

In [58]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5
six    2019       psy    10.0      9.9

In [59]:
df['year'] > 2017

one       True
two      False
three    False
four     False
five      True
six       True
Name: year, dtype: bool

In [60]:
df.loc[ df['year']>2017, : ]

      year     names  points  penalty
one   2018  sunyoung     2.9      0.1
five  2018   jungjae     6.9      0.5
six   2019       psy    10.0      9.9

In [61]:
df.loc[ df['names'] == 'sunyoung' , ['names','points'] ]

          names  points
one    sunyoung     2.9
two    sunyoung     3.7
three  sunyoung     4.6

In [62]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5
six    2019       psy    10.0      9.9

In [63]:
df.loc[(df['points'] > 3) & (df['points'] < 6) , : ]

       year     names  points  penalty
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4

In [64]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5
six    2019       psy    10.0      9.9

In [65]:
df.loc[ df['points'] > 5 , 'penalty' ] = 0

In [66]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.0
five   2018   jungjae     6.9      0.0
six    2019       psy    10.0      0.0